# 5. Найдите периметр(p) и площадь(s) квадрата , попросив пользователя ввести длину p) и площадь(s) квадрата , попросив пользователя ввести длину ) и площадь(p) и площадь(s) квадрата , попросив пользователя ввести длину s) квадрата , попросив пользователя ввести длину
# стороны квадрата. Попробуйте тоже самое сделать для прямоугольника.


# a = input('введите длину площади квадрата: ')
# print(int(a)**2)
# print(int(a)*4)


b = input('введите длину первую сторону прямоугольника: ')
d = input('введите длину вторую сторону прямоугольника: ')
print(int(b)*int(d))
print((int(b)+int(d))*2)
















